Repository: coala/coala
Catalog: locale/*.po
Languages: de_de

source: This file has {count} lines.
de_de: Die Datei hat {count} Zeilen.

source: Line contains the following keywords:
de_de: Zeile enthält die folgenden Schlüsselwörter:

source: Line is longer than allowed.
de_de: Zeile ist länger als erlaubt.

source: Line contains spacing inconsistencies.
de_de: Zeile enthält uneinheitliche Leerzeichen.

source: An internal error occurred.
de_de: Ein interner Fehler ist aufgetreten.

source: The given file through the queue is not in the file dictionary.
de_de: Die durch die Warteschlange übergebene Datei befindet sich nicht in dem Dateiordner.

source: A given local bear ({}) is not valid. Leaving it out...
de_de: Der lokale Bär ({}) ist nicht korrekt. Er wird ausgelassen...

source: A given global bear ({}) is not valid. Leaving it out...
de_de: Der globale Bär ({}) ist nicht korrekt. Er wird ausgelassen...

source: The bear {bear} failed to run with the arguments {arglist}, {kwarglist}. Skipping bear...
de_de: Der Bär {bear} konnte mit den Argumenten {arglist}, {kwarglist} nicht ausgeführt werden und wird übersprungen.

source: Traceback for error in bear {bear}:
de_de: Rückverfolgung für den Fehler in Bär {bear}:

source: One of the results can not be printed since it is not a valid derivative of the coala result class.
de_de: Eines der Ergebnisse kann nicht ausgegeben werden, da es keine korrekte Ableitung der coala result Klasse ist.

source: WARNING
de_de: WARNUNG

source: ERROR
de_de: FEHLER

source: Exception was:
de_de: Die Ausnahme war:

source: eSpeak doesn't seem to be installed. You cannot use the voice output feature without eSpeak. It can be downloaded from http://espeak.sourceforge.net/ or installed via your usual package repositories.
de_de: eSpeak scheint nicht installiert zu sein. Sie können die Sprachausgabefunktion nicht nutzen ohne eSpeak. eSpeak kann von http://espeak.sourceforge.net/ heruntergeladen oder über Ihre Paketrepositorys installiert werden.

source: Failed to execute eSpeak. An unknown error occurred.
de_de: eSpeak konnte nicht ausgeführt werden. Ein unbekannter Fehler ist aufgetreten.

source: Please enter a value for the setting "{}" ({}) needed by {}:
de_de: Bitte geben Sie einen Wert für die Einstellung "{}" ({}) ein, welche von {} benötigt wird:

source: The line belonging to the following result cannot be printed because it refers to a line that doesn't seem to exist in the given file.
de_de: Die Zeile die von diesem Resultat referenziert wird kann nicht ausgegeben werden, da sie nicht existiert.

source: Project wide:
de_de: Projektweit:

source: One of the given settings ({}) is not properly described.
de_de: Eine der übergebenen Einstellungen ({}) wurde nicht ordentlich beschrieben.

source: and
de_de: und

source: The following options are applicable to this result:
de_de: Die folgenden Optionen sind für dieses Ergebnis zutreffend:

source: Please enter a valid number.
de_de: Bitte geben Sie eine gültige Zahl ein.

source: Please enter a value for the parameter '{}' ({}):
de_de: Bitte geben Sie einen Wert für den Parameter '{}' ({}) ein:

source: A result ({}) cannot be printed because it refers to a file that doesn't seem to exist.
de_de: Das Ergebnis ({}) kann nicht ausgegeben werden, da es auf eine Datei verweist, welche nicht zu existieren scheint.

source: Executing section {name}...
de_de: Sektion {name} wird ausgeführt...

source: No existent section was targeted or enabled. Nothing to do.
de_de: Es wurde keine existierende Sektion ausgewählt oder aktiviert. Nichts zu tun.

source: Unable to collect bears from {file}. Probably the file is malformed or the module code raises an exception.
de_de: Aus {file} können keine Bären importiert werden. Die Datei ist wahrscheinlich inkorrekt oder der Modulcode wirft eine Ausnahme.

source: One of the given bears ({}) has no attribute get_non_optional_settings.
de_de: Einem der gegebenen Bären ({}) fehlt das Attribut get_non_optional_settings.

source: No description given.
de_de: Keine Beschreibung vorhanden.

source: Optional, defaults to '{}'.
de_de: Optional, standardmäßig '{}'.

source: Unable to convert {param} to the desired data type.
de_de: {param} kann nicht in den gewünschten Datentyp konvertiert werden.

source: Failed to instantiate the logging method '{}'. Falling back to console output.
de_de: Fehler beim instanziieren der Protokollmethode '{}'. Schalte auf Konsolenausgabe zurück.

source: The requested section '{section}' is not existent. Thus it cannot be executed.
de_de: Die angeforderte Sektion '{section}' kann nicht ausgeführt werden, da sie nicht existiert.

source: A string to test translations.
de_de: Eine Zeichenkette um Übersetzungen zu testen.

source: A not directly translated test string.
de_de: Ein indirekt übersetzter test String.

source: Setting up bear {}...
de_de: Bereite Bär {} vor...

source: Running bear {}...
de_de: Führe Bär {} aus...

source: Tearing down bear {}...
de_de: Beende Bär {}...

source: MAJOR
de_de: WICHTIG

source: This is a bug. We are sorry for the inconvenience. Please contact the developers for assistance.
de_de: Dies ist ein Fehler. Wir entschuldigen uns für die Unannehmlichkeiten. Bitte kontaktieren Sie die Entwickler für Unterstützung.

source: {} is not accessible and will be ignored!
de_de: Auf {} konnte nicht zugegriffen werden. Es wird ignoriert!

source: The bear {bear} raised an exception. If you are the writer of this bear, please make sure to catch all exceptions. If not and this error annoys you, you might want to get in contact with the writer of this bear. Traceback information is provided below: {traceback}
de_de: Der Bär {bear} hat eine Ausnahme geworfen. Wenn Sie der Autor dieses Bären sind, stellen Sie bitte sicher, dass Sie alle Ausnahmen fangen. Falls dies nicht der Fall sein sollte und dieser Fehler Sie stört, nehmen Sie am besten Kontakt mit dem Autoren dieses Bären auf. Rückverfolgungsinformationen sind im folgenden gegeben: {traceback}

source: Sections to be executed exclusively.
de_de: Sektionen die ausschließlich ausgeführt werden sollen.

source: Files that should be checked
de_de: Dateien die überprüft werden sollen

source: Names of bears to use
de_de: Namen der zu benutzenden Bären

source: Additional directories where bears may lie
de_de: Zusätzliche Ordner in denen Bären liegen können.

source: Type of logging (console or any filename)
de_de: Art der Protokollierung (console oder ein Dateiname)

source: Enum('ERR','WARN','DEBUG') to set level of log output
de_de: Setzt die Art der Prokollierung fest, Enum('ERR','WARN','DEBUG')

source: Configuration file to be used, defaults to .coafile
de_de: Zu benutzende Konfigurationsdatei, .coafile wenn nicht gegeben.

source: Filename of file to be saved to, if provided with no arguments, settings will be stored back to the file given by -c
de_de: Datei in die gespeichert werden soll. Wenn keine Argumente gegeben sind, werden die Einstellungen zurück in die durch -c gegebene Datei gespeichert.

source: Arbitrary settings in the form of section.key=value
de_de: Beliebige Einstellung in der Form section.key=value

source: Number of processes to be allowed to run at once
de_de: Anzahl an Prozessen, welche gleichzeitig ausgeführt werden dürfen

source: Enum('YES','NO','ASK') to set whether to apply changes
de_de: Legt fest ob Änderungen angewandt werden, Enum('YES','NO','ASK')

source: Program terminated by user.
de_de: Das Programm wurde durch den Benutzer beendet.

source: An unknown error occurred.
de_de: Ein unbekannter Fehler ist aufgetreten.

source: During execution of coala an exception was raised. This should never happen. When asked for, the following information may help investigating:
de_de: Während der Ausführung von coala ist eine Ausname geworfen worden. Dies sollte nie passieren. Falls Sie gefragt werden, könnten die folgenden Informationen bei der Untersuchung des Fehlers helfen:

source: Checks the space consistency for each line. :param use_spaces: True if spaces are to be used instead of tabs. :param allow_trailing_whitespace: Whether to allow trailing whitespace or not. :param tab_width: Number of spaces representing one tab.
de_de: Überprüft die Leerzeichenkonsistenz jeder Zeile. :param use_spaces: True wenn Leerzeichen anstelle von Tabs verwendet werden sollen. :param allow_trailing_whitespace: True wenn Leerzeichen an Zeilenenden erlaubt sein sollen. :param tab_width: Anzahl der Leerzeichen die einen Tab repräsentieren.

source: Test description. Do not translate except german. @param p1: A param.
de_de: Testbeschreibung. Nicht in Sprachen außer Deutsch übersetzen. @param p1: Ein parameter.
